#Типы Данных в питоне 

#1. NoneType - Ничего, пустота None 
#2. Boolean - Истина или Ложь True/False 
#3. str() - Строки: "Hello world", 'My name is john'
#4. Числовые типы данных:
#     #a. intiger - int() - Целое число (-1,-2,0,1)
#     #b. float()- Число в плавающей точкой (-1.2,10.15,2.7)
#     #c. complex() -Комплексные числа (3+5i6)
# #5. Спискорвые виды данных: 
#     #a. list(список/массив) (1,2,3, None, 'Hello', True, False, [1,2,3])
#     #b. tuple(кортеж) (1,2,3,4, None)
#     #c. range(последовательность)range (1,10)
# #6. set() - Множества 
# #7. dict(слловари)-  содержит данные  ввиде ключа и значения - {1; 'One', 2: 'Two'}
# ****************************************************************
# типы данных деляться на два вида 
# Mutable(изменения типы данных)
#    1. list
#    2. set 
#    3. dict
# Inmitable(неизменяеме типы данных)
#    1. NoneType
#    2. boolean
#    3. int float complex 
#    4. str 
#    5. range 
#    6. tuple 
#    7. frozenset
#***********************************************************

# """Стандартные виды данных"""
# """
# в пайтоне для вывода данных в терминал используется встроенная функция принт print()
# """
# print('Hello world! My name is Sam')
# print(27+3)

# """Стандартный ввод данных через терминал используется input()"""
# a = input('Введите число:')
# print('В a хранится:,a')
# print(a)
# print(input('Введите своё имя:'))


